In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1 = { "name" :["faraz", "rahul" , "rohan" ,"mohan"] ,
         "marks" :[92,55,78,45],
         "city" : ["rampur" , "kolkata","bihar","bhalki"]
        }

In [5]:
 df = pd.DataFrame(dict1)

In [6]:
df

    name  marks     city
0  faraz     92   rampur
1  rahul     55  kolkata
2  rohan     78    bihar
3  mohan     45   bhalki

In [7]:
df.to_csv("friends.csv",index = False)

In [8]:
df.head(2)

    name  marks     city
0  faraz     92   rampur
1  rahul     55  kolkata

In [9]:
df.tail(2)

    name  marks    city
2  rohan     78   bihar
3  mohan     45  bhalki

In [10]:
## for numerical values it will calculate mean , avg values
df.describe()

           marks
count   4.000000
mean   67.500000
std    21.393145
min    45.000000
25%    52.500000
50%    66.500000
75%    81.500000
max    92.000000

In [11]:
print("faraz ali ")

faraz ali

In [12]:
faraz = pd.read_csv("faraz.csv")

In [13]:
faraz

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,34
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

In [14]:
faraz['Leave']

0     34
1      0
2      0
3      2
4      0
      ..
94     0
95     0
96     0
97     0
98     0
Name: Leave, Length: 99, dtype: int64

In [15]:
faraz['Leave'][0]

34

In [16]:
faraz['Leave'][0] = 34

/tmp/ipykernel_1340/4047827236.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  faraz['Leave'][0] = 34

In [17]:
faraz.to_csv("faraz.csv",index = False)

In [ ]:
# faraz.index = ['first','secound','third']